// Написать программу. На входе 3-х значное число. На выходе сумма первой и последней цифры этого числа.

int a = 333;
Console.WriteLine(a % 10 + a / 100);
